In [3]:
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [4]:
titles = pd.read_csv('titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [5]:
cast = pd.read_csv('cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### Using groupby(), count the number of films that have been released each decade in the history of cinema.

In [6]:
titles.groupby(titles['year']//10*10).title.count().sort_index(ascending=True)

year
1890        3
1900       37
1910     6512
1920     8797
1930    10097
1940     8576
1950    12711
1960    17515
1970    18714
1980    20243
1990    22225
2000    38713
2010    67977
2020      210
Name: title, dtype: int64

In [7]:
(titles.year//10*10).value_counts().sort_index(ascending=True)

1890        3
1900       37
1910     6512
1920     8797
1930    10097
1940     8576
1950    12711
1960    17515
1970    18714
1980    20243
1990    22225
2000    38713
2010    67977
2020      210
Name: year, dtype: int64

### Use groupby() count the number of "Hamlet" films made each decade.

In [8]:
titles[titles.title=='Hamlet'].groupby(titles['year']//10*10).title.count().sort_index(ascending=True)

year
1910    3
1920    1
1940    1
1950    1
1960    2
1970    2
1980    1
1990    2
2000    2
2010    3
Name: title, dtype: int64

### How many leading (n=1) roles were available to actors, and how many to actresses, in each year of the 1950s?

In [9]:
cast[(cast.year//10*10==1950)&(cast.n==1)].type.value_counts()

actor      6616
actress    2965
Name: type, dtype: int64

### In the 1950s decade taken as a whole, how many total roles were available to actors, and how many to actresses, for each "n" number 1 through 5?

In [11]:
cast[(cast.year//10*10==1950)&(cast.n<=5)].groupby(['type','n']).size()

type     n
actor    1.0    6616
         2.0    4564
         3.0    5587
         4.0    5594
         5.0    5611
actress  1.0    2965
         2.0    4556
         3.0    3148
         4.0    2849
         5.0    2544
dtype: int64

In [12]:
cast

,title,year,name,type,character,n
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,NaN
1,Suuri illusioni,1985,Homo $,actor,Guests,22.0
2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN
...,...,...,...,...,...,...
3634462,Foxtrot,1988,Lilja ??risd?ttir,actress,D?ra,24.0
3634463,Niceland (Population. 1.000.002),2004,Sigr??ur J?na ??risd?ttir,actress,Woman in Bus,26.0
3634464,Skammdegi,1985,Dalla ??r?ard?ttir,actress,Hj?krunarkona,9.0
3634465,U.S.S.S.S...,2003,Krist?n Andrea ??r?ard?ttir,actress,Afgr.dama ? bens?nst??,17.0
3634466,Bye Bye Blue Bird,1999,Rosa ? R?gvu,actress,Pensionatv?rtinde,NaN

### Use groupby() to determine how many roles are listed for each of the Pink Panther movies.

In [13]:
cast[cast.title.str.find("Pink Panther")!=-1].groupby('title').size()

title
Curse of the Pink Panther          67
Revenge of the Pink Panther        64
Son of the Pink Panther            46
The Pink Panther                  111
The Pink Panther 2                 84
The Pink Panther Strikes Again     68
The Return of the Pink Panther     30
Trail of the Pink Panther          41
dtype: int64

### List, in order by year, each of the films in which Frank Oz has played more than 1 role.

In [121]:
(cast[cast.name=='Frank Oz'].groupby(['title','name','year'], as_index= False).count()[cast[cast.name=='Frank Oz'].groupby(['title','name','year'], as_index= False).count().type>1])[['title','year','character']].sort_values(by='year')

                                   title  year  character
22                      The Muppet Movie  1979          8
0         An American Werewolf in London  1981          2
20                The Great Muppet Caper  1981          6
19                      The Dark Crystal  1982          2
23            The Muppets Take Manhattan  1984          7
2                       Follow That Bird  1985          3
21            The Muppet Christmas Carol  1992          7
7                 Muppet Treasure Island  1996          4
8                     Muppets from Space  1999          4
17  The Adventures of Elmo in Grouchland  1999          3

### List each of the characters that Frank Oz has portrayed at least twice.

In [133]:
list(cast[cast.name=='Frank Oz'].character.value_counts()[cast[cast.name=='Frank Oz'].character.value_counts()>=2].index)

['Miss Piggy',
 'Yoda',
 'Animal',
 'Sam the Eagle',
 'Fozzie Bear',
 'Bert',
 'Cookie Monster',
 'Grover']